---
type: FabricationPartSizeMap
namespace: Autodesk.Revit.DB.Fabrication
version: 2024
members: 16
tags: [revit-api, class]
---

# FabricationPartSizeMap

`Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap` · Revit 2024 · 16 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FabricationPartSizeMap | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | AllowMultipleServiceSizes | 2018.2 | `public bool AllowMultipleServiceSizes { get ; set ; }` |
| Property | Depth | 2018.2 | `public double Depth { get ; set ; }` |
| Property | IsMappedProductList | 2018.2 | `public bool IsMappedProductList { get ; set ; }` |
| Property | IsProductList | 2018.2 | `public bool IsProductList { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MappedDepth | 2018.2 | `public double MappedDepth { get ; set ; }` |
| Property | MappedProfileType | 2018.2 | `public ConnectorProfileType MappedProfileType { get ; set ; }` |
| Property | MappedServiceId | 2018.2 | `public int MappedServiceId { get ; set ; }` |
| Property | MappedWidthDiameter | 2018.2 | `public double MappedWidthDiameter { get ; set ; }` |
| Property | PaletteId | 2018.2 | `public int PaletteId { get ; set ; }` |
| Property | ProfileType | 2018.2 | `public ConnectorProfileType ProfileType { get ; set ; }` |
| Property | ServiceId | 2018.2 | `public int ServiceId { get ; set ; }` |
| Property | SizeString | 2018.2 | `public string SizeString { get ; set ; }` |
| Property | WidthDiameter | 2018.2 | `public double WidthDiameter { get ; set ; }` |